In [2]:
from sqlalchemy import create_engine, inspect
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session


import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import datetime as dt

In [3]:
user = 'root'
password = '
mysql_uri = f'mysql://{user}:{password}@localhost/student_mobility'

print(mysql_uri)

mysql://root:Tamamasheer0@localhost/student_mobility

In [4]:
# Create Engine
engine = create_engine(mysql_uri, echo=False)

In [5]:
Base = automap_base()
Base.prepare(engine, reflect=True)

In [6]:
Student = Base.classes.students
Record = Base.classes.records
School = Base.classes.schools
Program = Base.classes.programs

In [7]:
# Initialize ORM Session
session = Session(bind=engine)

In [8]:
base_query = session.query(
    Record.student_id,
    Record.school_id,
).all()

base_query[:10]

[(300265, 27),
 (300456, 28),
 (301428, 23),
 (301661, 20),
 (301759, 61),
 (303104, 68),
 (303301, 22),
 (303962, 27),
 (304281, 28),
 (304396, 22)]

In [9]:
query_df = pd.DataFrame(
    base_query,
    columns = ['exit_count', 'school_id']
)

query_df.head()

   exit_count  school_id
0      300265         27
1      300456         28
2      301428         23
3      301661         20
4      301759         61

In [10]:
query_df.groupby('school_id')['exit_count'] \
    .count() \
    .sort_values(ascending=False) \
    .reset_index() \
    .head()

   school_id  exit_count
0         40        1670
1         37        1592
2         44        1573
3         35        1327
4         20        1272